//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================

//                   Объект RegExp

//           Юникод: флаг "u" и класс \p{...}

//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
/*
       /u   - активирует поиск в регулярном выражении
             по юникоду и юникодным свойствам


      \p{…} - юникодные свойства

-------------------------------------------------------
                  Юникодные свойства
-------------------------------------------------------
   Letter или L  - буква любого алфавита
   Number или N  - любая цифра
------------------------------------------------------
                         Буквы L
------------------------------------------------------
                в нижнем регистре  - Ll
                модификаторы       - Lm
                заглавные буквы    - Lt
                в верхнем регистре - Lu
                прочие             - Lo
------------------------------------------------------
                         Числа N
------------------------------------------------------
                дестичная цифра    - Nd
                римские цифрв      - Nl
                прочие             - No
-----------------------------------------------------
                   Знаки пунктуации P
-----------------------------------------------------
                соединители        - Pc
                тире               - Pd
            открывающие кавычки    - Pi
            закрывающие кавычки    - Pf
            открывающие скобки     - Ps
            закрывающие скобки     - Pe
            прочие                 - Po
-----------------------------------------------------
            Отметки M (например, акценты):
-----------------------------------------------------
                 двоеточия         - Mc
                 вложения          - Me
                 апострофы         - Mn
-----------------------------------------------------
                      Символы S     
-----------------------------------------------------
                 валюты            - Sc
                 модификаторы      - Sk
                 математические    - Sm
                 прочие            - So
-----------------------------------------------------
                    Разделители Z
-----------------------------------------------------
                 линия             - Zl
                 параграф          - Zp
                 пробел            - Zs
-----------------------------------------------------
*/
//===================================================
//                     ПРИМЕРЫ
//===================================================
// шестнадцатеричные числа
//---------------------------------------------------
{
    let regexp = /x\p{Hex_Digit}\p{Hex_Digit}/u;

    // console.log("число: xAF".match(regexp));
//['xAF', index: 7, input: 'число: xAF', 
//groups: undefined]
}

// китайские иероглифы
//---------------------------------------------------
{
    let regexp = /\p{sc=Han}/gu;

    let str = `Hello Привет 你好 123_456`;

    // console.log(str.match(regexp));
       // ['你', '好']
}

// кирилические буквы
//---------------------------------------------------
{
    let regexp = /\p{sc=Cyrillic}/gu;

    let str = `Hello Привет 你好 123_456`;

    // console.log(str.match(regexp));
    // ['П', 'р', 'и', 'в', 'е', 'т']
}

// валюта
//--------------------------------------------------
{
    let regexp = /\p{Sc}\d/gu;

    let str = `Цены: $2, €1, ¥9`;

    // console.log(str.match(regexp));
    //  ['$2', '€1', '¥9']
}
