//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================

//                   Объект RegExp

//                 Символьные классы

//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
/*
       Символьный класс    - спец. обозначение, которое
                             соответствует набору
                             
                             
            \d             - «digit» означает «цифра»
                             цифра-символ от 0 до 9

            \s             - «space» – «пробел»
                             символ пробела, табуляции 
                             \t, перевода строки \n и 
                             некоторые другие редкие 
                             пробельные символы, 
                             обозначаемые как \v, \f 
                             и \r

            \w             - «word» – «слово»
                             буква латинского алфавита 
                             или цифра или 
                             подчёркивание _.
                             Нелатинские буквы не 
                             являются частью класса \w, 
                             то есть буква русского 
                             алфавита не подходит.

            .              - любой символ, если с флагом 
                             регулярного выражения s, в 
                             противном случае любой 
                             символ, кроме перевода 
                             строки \n

--------------------------------------------------------
              Обратные символьные классы
--------------------------------------------------------

            \D            - Не цифра: любой символ, 
                            кроме \d, например буква

            \S            - Не пробел: любой символ, 
                            кроме \s, например буква

            \W            - Любой символ, кроме \w, 
                            то есть не буквы из латиницы,
                            не знак подчёркивания и не 
                            цифра. В частности, русские 
                            буквы принадлежат этому 
                            классу
-------------------------------------------------------*/
// ************* ПРИМЕР С ОДНОЙ ЦИФРОЙ ******************
{
    let str = '+7(903)-123-45-67';

    let regexp = /\d/;

    // console.log(str.match(regexp));
    // 7 - первая цифра
    //['7', index: 1, input: '+7(903)-123-45-67', 
    // groups: undefined]
}

// ************** ПРИМЕР С ФЛАГОМ \g ****************
{
    let str = '+7(903)-123-45-67';

    let regexp = /\d/g;

    // console.log(str.match(regexp));
    // выведет массив чисел
    // ['7', '9', '0', '3', '1', '2', '3', '4', 
    //'5', '6', '7']
}

//************* ПРИМЕР ПОСИМВОЛЬНОГО КЛАССА ***********
{
    let str = 'Я не остановился на HTML5!';

    let regexp = /\s\w\w\w\w\d/;

    // console.log(str.match(regexp));
    // ' HTML5'
    // [' HTML5', index: 19, 
    //input: 'Я не остановился на HTML5!', 
    // groups: undefined]
}

//************* ПРИМЕР C ОБРАТНЫМ КЛАССОМ ***********
{
    let str = "+7(903)-123-45-67";

    // console.log(str.replace(/\D/g, ''));
    // 79031234567
}

//************* ПРИМЕР C ТОЧКОЙ ***********
{
    // console.log('Ю'.match(/./)); 
//   ['Ю', index: 0, input: 'Ю', groups: undefined]
}
