//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================

//                   Объект RegExp

//           Юникод: флаг "u" и класс \p{...}

//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
//=====================================================
/*
       /u   - активирует поиск в регулярном выражении
             по юникоду и юникодным свойствам


      \p{…} - юникодные свойства

-------------------------------------------------------
                  Юникодные свойства
-------------------------------------------------------
   Letter или L  - буква любого алфавита
   Number или N  - любая цифра
------------------------------------------------------
                         Буквы L
------------------------------------------------------
                в нижнем регистре  - Ll
                модификаторы       - Lm
                заглавные буквы    - Lt
                в верхнем регистре - Lu
                прочие             - Lo
------------------------------------------------------
                         Числа N
------------------------------------------------------
                дестичная цифра    - Nd
                римские цифрв      - Nl
                прочие             - No
-----------------------------------------------------
                   Знаки пунктуации P
-----------------------------------------------------
                соединители        - Pc
                тире               - Pd
            открывающие кавычки    - Pi
            закрывающие кавычки    - Pf
            открывающие скобки     - Ps
            закрывающие скобки     - Pe
            прочие                 - Po
-----------------------------------------------------
            Отметки M (например, акценты):
-----------------------------------------------------
                 двоеточия         - Mc
                 вложения          - Me
                 апострофы         - Mn
-----------------------------------------------------
                      Символы S     
-----------------------------------------------------
                 валюты            - Sc
                 модификаторы      - Sk
                 математические    - Sm
                 прочие            - So
-----------------------------------------------------
                    Разделители Z
-----------------------------------------------------
                 линия             - Zl
                 параграф          - Zp
                 пробел            - Zs
-----------------------------------------------------
*/
//===================================================
//                     ПРИМЕРЫ
//===================================================
// шестнадцатеричные числа
//---------------------------------------------------
{
    let regexp = /x\p{Hex_Digit}\p{Hex_Digit}/u;

    // console.log("число: xAF".match(regexp));
//['xAF', index: 7, input: 'число: xAF', 
//groups: undefined]
}

// китайские иероглифы
//---------------------------------------------------
{
    let regexp = /\p{sc=Han}/gu;

    let str = `Hello Привет 你好 123_456`;

    // console.log(str.match(regexp));
       // ['你', '好']
}

// кирилические буквы
//---------------------------------------------------
{
    let regexp = /\p{sc=Cyrillic}/gu;

    let str = `Hello Привет 你好 123_456`;

    // console.log(str.match(regexp));
    // ['П', 'р', 'и', 'в', 'е', 'т']
}

// валюта
//--------------------------------------------------
{
    let regexp = /\p{Sc}\d/gu;

    let str = `Цены: $2, €1, ¥9`;

    // console.log(str.match(regexp));
    //  ['$2', '€1', '¥9']
}



//===================================================
//===================================================
//===================================================
//===================================================
//              Юникодные св-ва MDN

//           RegExp.prototype.unicode

//===================================================
//===================================================
//===================================================
//===================================================

/**
 *      Чтобы содать регулярное выражение с юникодом
 *       необходимо использовать флаг - u
 */
{ // ---- ПРИМЕР
    let regexp1 = new RegExp('\u{61}');
    let regexp2 = new RegExp('\u{61}', 'u');

    // console.log(regexp1.unicode); // false (boolean)
    // console.log(regexp2.unicode); // true (boolean)

    // console.log(regexp1.source); // a
    // console.log(regexp2.source); // a
}

/*
    Свойство Unicode экранирует регулярные выражения, 
    которые позволяют сопоставлять символы на основе 
    их свойств Unicode. 
    Символ описывается несколькими свойствами, которые 
    могут быть либо бинарными ("логическими"), 
    либо небинарными. 
    Например, escape-последовательности свойств Unicode 
    можно использовать для соответствия смайликам, 
    знакам препинания, буквам (даже буквам определенных 
    языков или сценариев) и т. д.
*/

/*
           \p{}   - экранирование юникодного св-ва

           \P{}   - экранирование исключения
*/
{//------ ПРИМЕР --------

    let sentence = 'A ticket to 大阪 costs ¥2000 👌.';
    let regexpEmoji = /\p{Emoji_Presentation}/gu;
    let result = sentence.match(regexpEmoji);

    // console.log(result); // ['👌']
}

/*   ------ Script_Extensions ------
     Если св-во может быть использованно в отельном
     кейсе а в друго нет, 
     например: пунктуация из конкретного языка,
     то оно управляется через
     расширенные св-ва script - Script_Extensions

     Script_Extensions = Latn
*/
{//----------ПРИМЕР--------
    let sentence = 'A ticket to 大阪 costs ¥2000 👌.';
    let notLatin = /\P{Script_Extensions=Latin}+/gu;
    let result = sentence.match(notLatin);

    // console.log(result);
    //[' ', ' ', ' 大阪 ', ' ¥2000 👌.']

    let currOrpunct = /\p{Sc}|\p{P}/gu;
    let result2 = sentence.match(currOrpunct);

    // console.log(result2); // ['¥', '.']
}

//===================================================
//===================================================
//        Где смотреть св-ва?
//===================================================
//===================================================

/* General
https://www.unicode.org/Public/UCD/latest/ucd/PropertyValueAliases.txt
https://unicode.org/reports/tr18/#General_Category_Property
*/


/* Script
https://unicode.org/reports/tr24/#Script
 */
